# Ultralytics ðŸš€ AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0: P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1: P2/4
  - [-1, 3, C2f, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3: P3/8
  - [-1, 6, C2f, [256, True]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5: P4/16
  - [-1, 6, C2f, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7: P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

# YOLOv8.0n head (SGC - larger)
head:
  - [9, 1, Conv, [192, 1, 1]]                            # 10  [512,192,1,1]
  - [-1, 1, AMRF, [192, 192]]                            # 11

  - [2, 1, ScaleMapHead, [1, 24]]                        # 12  S2: stride4 => 64x64
  - [-1, 1, ScaleMapDown, [1, 2]]                        # 13  down x2: 64->32 (S3, stride8)
  - [-1, 1, ScaleMapDown, [1, 2]]                        # 14  down x2: 32->16 (S4, stride16)

  - [4, 1, Conv, [128, 3, 2]]                            # 15
  - [6, 1, Conv, [128, 1, 1]]                            # 16
  - [11, 1, nn.Upsample, [None, 2, 'nearest']]           # 17
  - [-1, 1, Conv, [128, 1, 1]]                           # 18
  - [[15, 16, 18, 14], 1, SGCBlock, [128]]               # 19  dùng S4 (16x16)

  - [2, 1, Conv, [128, 3, 2]]                            # 20
  - [4, 1, Conv, [128, 1, 1]]                            # 21
  - [6, 1, nn.Upsample, [None, 2, 'nearest']]            # 22
  - [-1, 1, Conv, [128, 1, 1]]                           # 23
  - [[20, 21, 23, 13], 1, SGCBlock, [128]]               # 24  dùng S3 (32x32)

  - [[24, 19, 11], 1, Detect, [nc]]                      # 25  # Detect(P3/8, P4/16, P5/32)