# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0: P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1: P2/4
  - [-1, 3, C2f, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]    # 3: P3/8
  - [-1, 6, C2f, [256, True]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]    # 5: P4/16
  - [-1, 6, C2f, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]   # 7: P5/32
  - [-1, 3, C2f, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

# YOLOv8.0n head (SGC - larger)
head:
  # P5 refine
  - [9, 1, Conv, [512, 1, 1]]                    # 10: C5
  - [-1, 1, AMRF, [512]]                         # 11: P5_refined

  # scale map (tang c_mid 64 -> 96)
  - [2, 1, ScaleMapHead, [1, 96]]                # 12: S2
  - [-1, 1, ScaleMapDown, [1]]                   # 13: S3
  - [-1, 1, ScaleMapDown, [1]]                   # 14: S4

  # -------- Fuse at P4/16 (C = 384) --------
  - [4, 1, Conv, [384, 3, 2]]                    # 15: from P3 -> down to P4
  - [6, 1, Conv, [384, 1, 1]]                    # 16: P4 lateral
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]   # 17: P5 -> P4
  - [-1, 1, Conv, [384, 1, 1]]                   # 18
  - [[15, 16, 18, 14], 1, SGCBlock, [384]]       # 19: P4_fused (input list: f1,f2,f3,S4)

  # -------- Fuse at P3/8 (C = 384) --------
  - [2, 1, Conv, [384, 3, 2]]                    # 20: from P2 -> down to P3
  - [4, 1, Conv, [384, 1, 1]]                    # 21: P3 lateral
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]    # 22: P4 -> P3
  - [-1, 1, Conv, [384, 1, 1]]                   # 23
  - [[20, 21, 23, 13], 1, SGCBlock, [384]]       # 24: P3_fused (input list: f1,f2,f3,S3)
  
  # Detect: [P3_fused, P4_fused, P5_refined]
  - [[24, 19, 11], 1, Detect, [nc]]              # 25: Detect(P3, P4, P5)   