# Ultralytics ?? AGPL-3.0 License - https://ultralytics.com/license

# YOLOv9s object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov9
# Task docs: https://docs.ultralytics.com/tasks/detect
# 544 layers, 7318368 parameters, 27.6 GFLOPs

# Parameters
nc: 80 # number of classes

# GELAN backbone
backbone:
  - [-1, 1, Conv, [32, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]                  # 1-P2/4
  - [-1, 1, ELAN1, [64, 64, 32]]               # 2
  - [-1, 1, AConv, [128]]                      # 3-P3/8
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]   # 4
  - [-1, 1, AConv, [192]]                      # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]   # 6
  - [-1, 1, AConv, [256]]                      # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]  # 8
  - [-1, 1, SPPELAN, [256, 128]]               # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 10
  - [[-1, 6], 1, Concat, [1]]                          # 11
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 1]]           # 12

  - [-1, 1, AConv, [256]]                              # 13
  - [[-1, 9], 1, Concat, [1]]                          # 14
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]]          # 15

  - [2, 1, ScaleMapHead, [8, 16]]                      # 16 
  - [-1, 1, ScaleMapDown, [8, 4]]                      # 17

  - [12, 1, Conv, [96, 1, 1]]                          # 18
  - [15, 1, Conv, [96, 1, 1]]                          # 19
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 20
  - [[18, 18, 20, 17], 1, SGCBlock, [96]]              # 21

  - [[21, 15], 1, Detect, [nc]]                        # 22