# Ultralytics ?? AGPL-3.0 License - https://ultralytics.com/license

# YOLOv9s object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov9
# Task docs: https://docs.ultralytics.com/tasks/detect
# 544 layers, 7318368 parameters, 27.6 GFLOPs

# Parameters
nc: 80 # number of classes

# GELAN backbone
backbone:
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4
  - [-1, 1, ELAN1, [64, 64, 32]] # 2
  - [-1, 1, AConv, [128]] # 3-P3/8
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 4
  - [-1, 1, AConv, [192]] # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]] # 6
  - [-1, 1, AConv, [256]] # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]] # 8
  - [-1, 1, SPPELAN, [256, 128]] # 9

head:
  # --- P5 context (light) ---
  - [9, 1, Conv, [160, 1, 1]]                      # 13
  - [-1, 1, AMRF, [160]]                           # 14: P5_ctx

  # --- Scale maps from C2 ---
  - [2, 1, ScaleMapHead, [1, 32]]                  # 15: S2
  - [-1, 1, ScaleMapDown, [1]]                     # 16: S3
  - [-1, 1, ScaleMapDown, [1]]                     # 17: S4

  # --- P4 fuse only ---
  - [4, 1, AConv, [128]]                           # 18: P3 -> P4
  - [12, 1, Conv, [128, 1, 1]]                     # 19: P4 lateral
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]     # 20: P5_ctx -> P4
  - [-1, 1, Conv, [128, 1, 1]]                     # 21
  - [[18, 19, 21, 17], 1, SGCBlock, [128]]         # 22: P4_fused

  - [[22, 14], 1, Detect, [nc]]                    # Detect(P4,P5)
