# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80    # number of classes
scales:   # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024]   # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512]    # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512]    # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512]    # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 2, C2PSA, [1024]]            # 10

# YOLO11n head
head:
  - [10, 1, Conv, [384, 1, 1]]                                # 11: P5 1024->384
  - [-1, 1, AMRF, [384]]                                      # 12: P5 refined

  - [2, 1, ScaleMapHead, [1, 64]]                             # 13: S2 from C2(stride4), 1ch map
  - [-1, 1, ScaleMapDown, [1]]                                # 14: down -> S3(stride8)
  - [-1, 1, ScaleMapDown, [1]]                                # 15: down -> S4(stride16)

  # --- Fuse at P4/16 (C=256): (P3->P4) + P4 + (P5->P4) + S4 ---
  - [4, 1, Conv, [192, 3, 2]]                                 # 16: P3 down -> P4
  - [6, 1, Conv, [192, 1, 1]]                                 # 17: P4 lateral
  - [12, 1, nn.Upsample, [None, 2, "nearest"]]                # 18: P5 up -> P4
  - [-1, 1, Conv, [192, 1, 1]]                                # 19
  - [[16, 17, 19, 15], 1, SGCBlock, [192]]                    # 20: P4_fused (list input)

  # --- Fuse at P3/8 (C=256): (P2->P3) + P3 + (P4->P3) + S3 ---
  - [2, 1, Conv, [192, 3, 2]]                                 # 21: P2 down -> P3
  - [4, 1, Conv, [192, 1, 1]]                                 # 22: P3 lateral
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]                 # 23: P4 up -> P3
  - [-1, 1, Conv, [192, 1, 1]]                                # 24
  - [[21, 22, 24, 14], 1, SGCBlock, [192]]                    # 25: P3_fused (list input)

  # Detect: [P3_fused, P4_fused, P5_refined]
  - [[25, 20, 12], 1, Detect, [nc]]                           # 32: Detect(P3_fused, P4_fused, P5_refined)