# Ultralytics ?? AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5-SGC: YOLOv5 backbone + SGC neck with P2/4 - P5/32 outputs

# Parameters
nc: 1  # number of classes (edit to match your dataset)
scales:  # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5_sgc.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 backbone (kept the same as the original yolov5.yaml)
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C3, [128]]            # 2-P2/4 (C2)
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C3, [256]]            # 4-P3/8 (C3)
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 9, C3, [512]]            # 6-P4/16 (C4)
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C3, [1024]]           # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9-P5/32 (C5)

# SGC head v2: P3 (stride 8), P4 (stride 16), P5 (stride 32); P2 is optional (stride 4, not used in Detect)
head:
  # ---------- P5: context from C5 with AMRF ----------
  - [ 9, 1, Conv, [512, 1, 1]]                  # 10: C5 -> 512 channels
  - [ -1, 1, AMRF, [512] ]                      # 11: P5 (stride 32, 512 channels)

  # ---------- Scale maps from C2 ----------
  - [ 2, 1, ScaleMapHead, [1, 64] ]             # 12: S2 (stride 4, 1 channel), c_mid=64
  - [ -1, 1, ScaleMapDown, [1] ]                # 13: S3 (stride 8, 1 channel)
  - [ -1, 1, ScaleMapDown, [1] ]                # 14: S4 (stride 16, 1 channel)

  # ---------- P4 (stride 16) with SGCBlock ----------
  # 3 feature branches:
  #  - from C3 (layer 4), downsample -> stride 16, 256 channels
  #  - from C4 (layer 6), keep stride 16, reduce to 256 channels
  #  - from P5 (layer 11), upsample -> stride 16, 256 channels
  - [ 4, 1, Conv, [256, 3, 2] ]                 # 15: C3 -> 40x40, 256
  - [ 6, 1, Conv, [256, 1, 1] ]                 # 16: C4 -> 40x40, 256
  - [ 11, 1, nn.Upsample, [None, 2, "nearest"] ]# 17: P5 20x20 -> 40x40
  - [ -1, 1, Conv, [256, 1, 1] ]                # 18: -> 40x40, 256

  # concat 3 features (3*256) + scale map S4 (layer 14, 1 channel) -> 3*C+1 channels
  - [ [15, 16, 18, 14], 1, Concat, [1] ]        # 19: (3*256 + 1) channels
  - [ -1, 1, SGCBlock, [256] ]                  # 20: P4 (stride 16, 256 channels)

  # ---------- P3 (stride 8) with SGCBlock ----------
  # 3 feature branches:
  #  - from C2 (layer 2), downsample -> stride 8, 256 channels
  #  - from C3 (layer 4), stride 8, 256 channels
  #  - from C4 (layer 6), upsample -> stride 8, 256 channels
  - [ 2, 1, Conv, [256, 3, 2] ]                 # 21: C2 160x160 -> 80x80, 256
  - [ 4, 1, Conv, [256, 1, 1] ]                 # 22: C3 -> 80x80, 256
  - [ 6, 1, nn.Upsample, [None, 2, "nearest"] ] # 23: C4 40x40 -> 80x80
  - [ -1, 1, Conv, [256, 1, 1] ]                # 24: -> 80x80, 256

  # concat 3 features + scale map S3 (layer 13)
  - [ [21, 22, 24, 13], 1, Concat, [1] ]        # 25: (3*256 + 1) channels
  - [ -1, 1, SGCBlock, [256] ]                  # 26: P3 (stride 8, 256 channels)

  # ---------- P2 (stride 4) with SGCBlock ----------
  # 3 feature branches:
  #  - from C2 (layer 2), stride 4, 128 channels
  #  - from C3 (layer 4), upsample -> stride 4, 128 channels
  #  - from C4 (layer 6), upsample -> stride 4, 128 channels
  - [ 2, 1, Conv, [128, 1, 1] ]                 # 27: C2 -> 160x160, 128
  - [ 4, 1, nn.Upsample, [None, 2, "nearest"] ] # 28: C3 80x80 -> 160x160
  - [ -1, 1, Conv, [128, 1, 1] ]                # 29: -> 160x160, 128
  - [ 6, 1, nn.Upsample, [None, 4, "nearest"] ] # 30: C4 40x40 -> 160x160
  - [ -1, 1, Conv, [128, 1, 1] ]                # 31: -> 160x160, 128

  # concat 3 features + scale map S2 (layer 12)
  - [ [27, 29, 31, 12], 1, Concat, [1] ]        # 32: (3*128 + 1) channels
  - [ -1, 1, SGCBlock, [128] ]                  # 33: P2 (stride 4, 128 channels)

  # ---------- Detect at 3 scales: P3, P4, P5 ----------
  - [ [26, 20, 11], 1, Detect, [nc] ]           # 34: Detect(P3, P4, P5)
