# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5-SGC: YOLOv5 backbone + SGC neck with P3/8 - P5/32 outputs

# Parameters
nc: 1  # number of classes (edit to match your dataset)
scales:  # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5s_sgc.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 backbone (same as original yolov5.yaml)
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C3, [128]]             # 2-P2/4 (C2)
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C3, [256]]             # 4-P3/8 (C3)
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 9, C3, [512]]             # 6-P4/16 (C4)
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C3, [1024]]            # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9-P5/32 (C5)

head:
  # ---------- P5: context from C5 with AMRF ----------
  - [9, 1, Conv, [384, 1, 1]]                      # 10: C5 -> 384
  - [-1, 1, AMRF, [384]]                           # 11: P5 (stride 32)

  # ---------- Scale maps from C2 ----------
  - [2, 1, ScaleMapHead, [1, 64]]                  # 12: S2 (stride 4), out=1 (keep fixed)
  - [-1, 1, ScaleMapDown, [1]]                     # 13: S3 (stride 8), out=1 (keep fixed)
  - [-1, 1, ScaleMapDown, [1]]                     # 14: S4 (stride 16), out=1 (keep fixed)

  # ---------- P4 (stride 16) with SGCBlock ----------
  - [4, 1, Conv, [192, 3, 2]]                      # 15: C3 -> stride16, 192
  - [6, 1, Conv, [192, 1, 1]]                      # 16: C4 -> stride16, 192
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]     # 17: P5 up -> stride16
  - [-1, 1, Conv, [192, 1, 1]]                     # 18: -> 192
  - [[15, 16, 18, 14], 1, SGCBlock, [192]]         # 19: P4 (expects list [f1,f2,f3,S4])

  # ---------- P3 (stride 8) with SGCBlock ----------
  - [2, 1, Conv, [192, 3, 2]]                      # 20: C2 -> stride8, 192
  - [4, 1, Conv, [192, 1, 1]]                      # 21: C3 -> stride8, 192
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]      # 22: C4 up -> stride8
  - [-1, 1, Conv, [192, 1, 1]]                     # 23: -> 192
  - [[20, 21, 23, 13], 1, SGCBlock, [192]]         # 24: P3 (expects list [f1,f2,f3,S3])

  # ---------- Detect at 3 scales ----------
  - [[24, 19, 11], 1, Detect, [nc]]                # 25: Detect(P3, P4, P5)
