# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv5 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov5
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]      # 9

# YOLOv5 + L-FPN head (P2, P3, P4, P5)
head:
  # 10: L-FPN, nhận P2, P3, P4, P5 từ backbone
  # from = [2, 4, 6, 9] (theo backbone ở trên)
  - [[2, 4, 6, 9], 1, L_FPN, []]

  # 11–14: tách 4 nhánh P2', P3', P4', P5' từ output của L_FPN(10)
  - [10, 1, LFPNSplit, [0]]   # 11: P2_out, stride 4
  - [10, 1, LFPNSplit, [1]]   # 12: P3_out, stride 8
  - [10, 1, LFPNSplit, [2]]   # 13: P4_out, stride 16
  - [10, 1, LFPNSplit, [3]]   # 14: P5_out, stride 32

  # 15: Detect dùng bốn feature map P2', P3', P4', P5'
  - [[11, 12, 13, 14], 1, Detect, [nc]]
